# Brewfile - managed by dotfiles
# Run: brew bundle --file=<path>/Brewfile

# Taps
tap "hashicorp/tap"

# Core tools
brew "zsh"
brew "starship"
brew "git"
brew "gh"
brew "git-crypt"
brew "azure-cli"
brew "stow"

# iOS/macOS development
brew "cocoapods"

# Java version management
brew "jenv"
brew "openjdk@21"
brew "openjdk"

# Infrastructure tools
brew "hashicorp/tap/terraform"

# Casks
cask "claude-code"
cask "dotnet-sdk"
cask "flutter"
cask "android-commandlinetools"
cask "iterm2"

# Fonts (requires homebrew/cask-fonts tap)
cask "font-fira-code-nerd-font"
